# 할로윈 투자 전략
1. 11월 첫날 매수 -> 4월 마지막 날 매도
2. 11월 첫날의 가격의 시가로 매수
3. 4월 말일의 종가로 매도
4. 수익률 계산 -> 매도가 / 매수가
5. 누적 수익률 계산

In [3]:
import pandas as pd
import numpy as np
from datetime import datetime
from dateutil.relativedelta import relativedelta

/var/folders/lj/ms0l79910fz22cg2hchczhw40000gn/T/ipykernel_9260/2587923531.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [4]:
df = pd.read_csv('../../csv/AMZN.csv', index_col='Date')
df.head(5)

                Open      High       Low     Close  Adj Close    Volume
Date
1997-05-15  2.437500  2.500000  1.927083  1.958333   1.958333  72156000
1997-05-16  1.968750  1.979167  1.708333  1.729167   1.729167  14700000
1997-05-19  1.760417  1.770833  1.625000  1.708333   1.708333   6106800
1997-05-20  1.729167  1.750000  1.635417  1.635417   1.635417   5467200
1997-05-21  1.635417  1.645833  1.375000  1.427083   1.427083  18853200

In [5]:
df.index = pd.to_datetime(df.index, format='%Y-%m-%d')

In [6]:
# 2000년 11월 데이터 출력
df.loc['2000-11', ].iloc[0,0]

35.8125

In [7]:
df.loc['2000-11',].head(1)['Open']

Date
2000-11-01    35.8125
Name: Open, dtype: float64

In [8]:
df.loc['2000-11', 'Open'][0]

/var/folders/lj/ms0l79910fz22cg2hchczhw40000gn/T/ipykernel_9260/1122638607.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc['2000-11', 'Open'][0]

35.8125

In [9]:
df.loc['2001-04', 'Close'][-1]

/var/folders/lj/ms0l79910fz22cg2hchczhw40000gn/T/ipykernel_9260/2496373566.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc['2001-04', 'Close'][-1]

15.78

In [10]:
df.loc['2000-11'].tail(1)

             Open     High     Low    Close  Adj Close    Volume
Date
2000-11-30  24.75  26.1875  22.875  24.6875    24.6875  13123500

In [11]:
df.loc['2010-04-30',]

Open         1.414000e+02
High         1.414000e+02
Low          1.369100e+02
Close        1.371000e+02
Adj Close    1.371000e+02
Volume       6.113500e+06
Name: 2010-04-30 00:00:00, dtype: float64

In [12]:
df.loc['2000-11'].head(1)
df.loc['2001-04'].tail(1)

             Open  High    Low  Close  Adj Close   Volume
Date
2001-04-30  15.63  16.9  15.59  15.78      15.78  5780300

In [13]:
# 2000~2010
price_df = pd.DataFrame()

for i in range(2000, 2010, 1) :
    buy_month = f'{i}-11'
    sell_month = str(i+1) + "-04" # 문자열 합치기

    buy = df.loc[buy_month, ].head(1)
    sell = df.loc[sell_month, ].tail(1)
    price_df = pd.concat([price_df, buy, sell], axis=0) # ignore_index : 인덱스 초기화

price_df

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2000-11-01,35.812500,40.000000,35.687500,37.375000,37.375000,11099200
2001-04-30,15.630000,16.900000,15.590000,15.780000,15.780000,5780300
2001-11-01,7.080000,7.100000,6.600000,6.950000,6.950000,5053500
2002-04-30,16.129999,16.760000,15.930000,16.690001,16.690001,6420800
2002-11-01,19.219999,19.900000,19.090000,19.799999,19.799999,5549400
2003-04-30,28.600000,29.000000,28.379999,28.690001,28.690001,9450000
2003-11-03,54.799999,56.799999,54.310001,56.740002,56.740002,9131100
2004-04-30,46.060001,46.349998,43.310001,43.599998,43.599998,9841300
2004-11-01,34.220001,35.150002,34.150002,35.099998,35.099998,6181300
2005-04-29,32.860001,32.889999,31.520000,32.360001,32.360001,10523500
2005-11-01,39.970001,40.740002,39.650002,40.369999,40.369999,5383000
2006-04-28,35.770000,35.889999,35.139999,35.209999,35.209999,3492500
2006-11-01,38.130001,38.200001,37.459999,37.560001,37.560001,6668900
2007-04-30,61.910000,62.439999,61.180000,61.330002,61.330002,23979200
2007-11-01,87.750000,89.580002,86.500000,87.650002,87.650002,8265700
2008-04-30,80.900002,81.339996,77.919998,78.629997,78.629997,7875700
2008-11-03,56.349998,57.250000,55.020000,55.770000,55.770000,7170100
2009-04-30,80.930000,82.669998,79.889999,80.519997,80.519997,8537600
2009-11-02,118.660004,119.500000,116.709999,118.839996,118.839996,11280000
2010-04-30,141.399994,141.399994,136.910004,137.100006,137.100006,6113500

In [14]:
price_df = price_df[['Open', 'Close']]

In [15]:
# 수익률 컬럼 생성
price_df['rtn'] = 1

/var/folders/lj/ms0l79910fz22cg2hchczhw40000gn/T/ipykernel_9260/1178645707.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  price_df['rtn'] = 1

In [16]:
# 위치 값이 홀수인 경우 수익률 계산
for i in range(len(price_df)) :
    if i % 2 == 1 :
        rtn = price_df.iloc[i,]['Close'] / price_df.iloc[i-1,]['Open']
        price_df.iloc[i,2] = rtn

/var/folders/lj/ms0l79910fz22cg2hchczhw40000gn/T/ipykernel_9260/2419298158.py:5: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '0.4406282722513089' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  price_df.iloc[i,2] = rtn

In [17]:
price_df['rtn2'] = 1

for i in range(1, len(price_df), 2) :
    rtn2 = price_df.iloc[i,]['Close'] / price_df.iloc[i-1,]['Open']
    price_df.iloc[i,3] = rtn2

price_df

/var/folders/lj/ms0l79910fz22cg2hchczhw40000gn/T/ipykernel_9260/4066661178.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  price_df['rtn2'] = 1
/var/folders/lj/ms0l79910fz22cg2hchczhw40000gn/T/ipykernel_9260/4066661178.py:5: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '0.4406282722513089' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  price_df.iloc[i,3] = rtn2

                  Open       Close       rtn      rtn2
Date
2000-11-01   35.812500   37.375000  1.000000  1.000000
2001-04-30   15.630000   15.780000  0.440628  0.440628
2001-11-01    7.080000    6.950000  1.000000  1.000000
2002-04-30   16.129999   16.690001  2.357345  2.357345
2002-11-01   19.219999   19.799999  1.000000  1.000000
2003-04-30   28.600000   28.690001  1.492716  1.492716
2003-11-03   54.799999   56.740002  1.000000  1.000000
2004-04-30   46.060001   43.599998  0.795620  0.795620
2004-11-01   34.220001   35.099998  1.000000  1.000000
2005-04-29   32.860001   32.360001  0.945646  0.945646
2005-11-01   39.970001   40.369999  1.000000  1.000000
2006-04-28   35.770000   35.209999  0.880911  0.880911
2006-11-01   38.130001   37.560001  1.000000  1.000000
2007-04-30   61.910000   61.330002  1.608445  1.608445
2007-11-01   87.750000   87.650002  1.000000  1.000000
2008-04-30   80.900002   78.629997  0.896068  0.896068
2008-11-03   56.349998   55.770000  1.000000  1.000000
2009-04-30   80.930000   80.519997  1.428926  1.428926
2009-11-02  118.660004  118.839996  1.000000  1.000000
2010-04-30  141.399994  137.100006  1.155402  1.155402

In [18]:
flag = price_df.index.month == 4

In [19]:
price_df['rtn3'] = 1

/var/folders/lj/ms0l79910fz22cg2hchczhw40000gn/T/ipykernel_9260/1699705598.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  price_df['rtn3'] = 1

In [20]:
price_df.loc[flag,]

                  Open       Close       rtn      rtn2  rtn3
Date
2001-04-30   15.630000   15.780000  0.440628  0.440628     1
2002-04-30   16.129999   16.690001  2.357345  2.357345     1
2003-04-30   28.600000   28.690001  1.492716  1.492716     1
2004-04-30   46.060001   43.599998  0.795620  0.795620     1
2005-04-29   32.860001   32.360001  0.945646  0.945646     1
2006-04-28   35.770000   35.209999  0.880911  0.880911     1
2007-04-30   61.910000   61.330002  1.608445  1.608445     1
2008-04-30   80.900002   78.629997  0.896068  0.896068     1
2009-04-30   80.930000   80.519997  1.428926  1.428926     1
2010-04-30  141.399994  137.100006  1.155402  1.155402     1

In [21]:
for i in price_df.index :
    if i.month == 4:
        rtn = price_df.loc[i, 'Close'] / price_df.shift().loc[i, 'Open']
        price_df.loc[i, 'rtn3'] = rtn

price_df

/var/folders/lj/ms0l79910fz22cg2hchczhw40000gn/T/ipykernel_9260/1925016373.py:4: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '0.4406282722513089' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  price_df.loc[i, 'rtn3'] = rtn

                  Open       Close       rtn      rtn2      rtn3
Date
2000-11-01   35.812500   37.375000  1.000000  1.000000  1.000000
2001-04-30   15.630000   15.780000  0.440628  0.440628  0.440628
2001-11-01    7.080000    6.950000  1.000000  1.000000  1.000000
2002-04-30   16.129999   16.690001  2.357345  2.357345  2.357345
2002-11-01   19.219999   19.799999  1.000000  1.000000  1.000000
2003-04-30   28.600000   28.690001  1.492716  1.492716  1.492716
2003-11-03   54.799999   56.740002  1.000000  1.000000  1.000000
2004-04-30   46.060001   43.599998  0.795620  0.795620  0.795620
2004-11-01   34.220001   35.099998  1.000000  1.000000  1.000000
2005-04-29   32.860001   32.360001  0.945646  0.945646  0.945646
2005-11-01   39.970001   40.369999  1.000000  1.000000  1.000000
2006-04-28   35.770000   35.209999  0.880911  0.880911  0.880911
2006-11-01   38.130001   37.560001  1.000000  1.000000  1.000000
2007-04-30   61.910000   61.330002  1.608445  1.608445  1.608445
2007-11-01   87.750000   87.650002  1.000000  1.000000  1.000000
2008-04-30   80.900002   78.629997  0.896068  0.896068  0.896068
2008-11-03   56.349998   55.770000  1.000000  1.000000  1.000000
2009-04-30   80.930000   80.519997  1.428926  1.428926  1.428926
2009-11-02  118.660004  118.839996  1.000000  1.000000  1.000000
2010-04-30  141.399994  137.100006  1.155402  1.155402  1.155402

In [22]:
price_df['rtn'].cumprod()

Date
2000-11-01    1.000000
2001-04-30    0.440628
2001-11-01    0.440628
2002-04-30    1.038713
2002-11-01    1.038713
2003-04-30    1.550503
2003-11-03    1.550503
2004-04-30    1.233612
2004-11-01    1.233612
2005-04-29    1.166560
2005-11-01    1.166560
2006-04-28    1.027635
2006-11-01    1.027635
2007-04-30    1.652894
2007-11-01    1.652894
2008-04-30    1.481106
2008-11-03    1.481106
2009-04-30    2.116392
2009-11-02    2.116392
2010-04-30    2.445283
Name: rtn, dtype: float64

In [23]:
start = datetime(year=2000, month=11, day=1)
start

datetime.datetime(2000, 11, 1, 0, 0)

In [24]:
start + relativedelta(months=5) # 5달 후

datetime.datetime(2001, 4, 1, 0, 0)

In [25]:
start + relativedelta(days=5) # 5일 후

datetime.datetime(2000, 11, 6, 0, 0)

In [26]:
end = start + relativedelta(months=5)

In [27]:
start = start.strftime('%Y-%m')
start

'2000-11'

In [28]:
end = end.strftime('%Y-%m')
end

'2001-04'

In [29]:
# 할로윈 전략 함수화
def six_month(_df, _start = 2000, _end = datetime.now().year, _month = 11) :
    df = _df.copy()
    if 'Date' in df.columns :
        df.set_index('Date', inplace=True)

    df.index = pd.to_datetime(df.index, format='%Y-%m-%d')
    df = df[['Open', 'Close']]

    result = pd.DataFrame() # 비어있는 데이터프레임

    for i in range(_start, _end) :
        start = datetime(year = i, month=_month, day=1)
        end = start + relativedelta(months=5)

        buy_month = start.strftime('%Y-%m')
        sell_month = end.strftime('%Y-%m')

        try :
            buy = df.loc[buy_month].head(1)
            sell = df.loc[sell_month].tail(1)

            result = pd.concat([result, buy, sell], axis=0)

        except :
            break


    result['rtn'] = 1
    for i in range(1, len(result), 2) :
        rtn = result.iloc[i,]['Close'] / result.iloc[i-1,]['Open']
        result.iloc[i, 2] = rtn

    result['acc_rtn'] = result['rtn'].cumprod()
    acc_rtn = result.iloc[-1,]['acc_rtn']

    return result, acc_rtn

In [30]:
df = pd.read_csv('../../csv/AMZN.csv')

In [31]:
six_month(df)

/var/folders/lj/ms0l79910fz22cg2hchczhw40000gn/T/ipykernel_9260/2451495709.py:32: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '0.4406282722513089' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  result.iloc[i, 2] = rtn

(                   Open        Close       rtn   acc_rtn
 Date
 2000-11-01    35.812500    37.375000  1.000000  1.000000
 2001-04-30    15.630000    15.780000  0.440628  0.440628
 2001-11-01     7.080000     6.950000  1.000000  0.440628
 2002-04-30    16.129999    16.690001  2.357345  1.038713
 2002-11-01    19.219999    19.799999  1.000000  1.038713
 2003-04-30    28.600000    28.690001  1.492716  1.550503
 2003-11-03    54.799999    56.740002  1.000000  1.550503
 2004-04-30    46.060001    43.599998  0.795620  1.233612
 2004-11-01    34.220001    35.099998  1.000000  1.233612
 2005-04-29    32.860001    32.360001  0.945646  1.166560
 2005-11-01    39.970001    40.369999  1.000000  1.166560
 2006-04-28    35.770000    35.209999  0.880911  1.027635
 2006-11-01    38.130001    37.560001  1.000000  1.027635
 2007-04-30    61.910000    61.330002  1.608445  1.652894
 2007-11-01    87.750000    87.650002  1.000000  1.652894
 2008-04-30    80.900002    78.629997  0.896068  1.481106
 2008-11-03    56.349998    55.770000  1.000000  1.481106
 2009-04-30    80.930000    80.519997  1.428926  2.116392
 2009-11-02   118.660004   118.839996  1.000000  2.116392
 2010-04-30   141.399994   137.100006  1.155402  2.445283
 2010-11-01   164.449997   162.580002  1.000000  2.445283
 2011-04-29   194.380005   195.809998  1.190696  2.911590
 2011-11-01   208.110001   212.100006  1.000000  2.911590
 2012-04-30   223.949997   231.899994  1.114315  3.244427
 2012-11-01   234.229996   232.139999  1.000000  3.244427
 2013-04-30   249.369995   253.809998  1.083593  3.515638
 2013-11-01   365.630005   359.000000  1.000000  3.515638
 2014-04-30   298.100006   304.130005  0.831797  2.924298
 2014-11-03   306.239990   305.720001  1.000000  2.924298
 2015-04-30   427.109985   421.779999  1.377286  4.027594
 2015-11-02   627.130005   628.349976  1.000000  4.027594
 2016-04-29   666.000000   659.590027  1.051760  4.236061
 2016-11-01   799.000000   785.409973  1.000000  4.236061
 2017-04-28   948.830017   924.989990  1.157685  4.904023
 2017-11-01  1105.400024  1103.680054  1.000000  4.904023
 2018-04-30  1582.500000  1566.130005  1.416799  6.948016
 2018-11-01  1623.530029  1665.530029  1.000000  6.948016
 2019-04-30  1930.099976  1926.520020  1.186624  8.244684,
 8.244683980501206)

In [32]:
#pip install yfinance

In [33]:
import yfinance as yf

In [34]:
aapl = pd.read_csv('../../csv/AAPL.csv')

In [35]:
sdi = yf.download('006400.KS', start='2015-01-01')

[*********************100%%**********************]  1 of 1 completed

In [47]:
six_month(aapl, _start=2010)

/var/folders/lj/ms0l79910fz22cg2hchczhw40000gn/T/ipykernel_9260/2451495709.py:32: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '1.1585268601778382' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  result.iloc[i, 2] = rtn

(                  Open       Close       rtn   acc_rtn
 Date
 2010-11-01   43.174286   43.454285  1.000000  1.000000
 2011-04-29   49.540001   50.018570  1.158527  1.158527
 2011-11-01   56.772858   56.644287  1.000000  1.158527
 2012-04-30   85.400002   83.425713  1.469465  1.702414
 2012-11-01   85.459999   85.220001  1.000000  1.702414
 2013-04-30   62.157143   63.254284  0.740162  1.260063
 2013-11-01   74.860001   74.290001  1.000000  1.260063
 2014-04-30   84.662857   84.298569  1.126083  1.418936
 2014-11-03  108.220001  109.400002  1.000000  1.418936
 2015-04-30  128.639999  125.150002  1.156441  1.640915
 2015-11-02  120.800003  121.180000  1.000000  1.640915
 2016-04-29   93.989998   93.739998  0.775993  1.273339
 2016-11-01  113.459999  111.489998  1.000000  1.273339
 2017-04-28  144.089996  143.649994  1.266085  1.612155
 2017-11-01  169.869995  166.889999  1.000000  1.612155
 2018-04-30  162.130005  165.259995  0.972862  1.568404
 2018-11-01  219.050003  222.220001  1.000000  1.568404
 2019-04-30  203.059998  200.669998  0.916092  1.436803,
 1.4368026302332717)

In [41]:
aapl.tail()

,Date,Open,High,Low,Close,Adj Close,Volume
9710,2019-06-18,196.050003,200.289993,195.210007,198.449997,198.449997,26551000.0
9711,2019-06-19,199.679993,199.880005,197.309998,197.869995,197.869995,21124200.0
9712,2019-06-20,200.369995,200.610001,198.029999,199.460007,199.460007,21514000.0
9713,2019-06-21,198.800003,200.850006,198.149994,198.779999,198.779999,47735300.0
9714,2019-06-24,198.539993,200.160004,198.169998,199.169998,199.169998,9025362.0

In [45]:
# 1~12월까지 6개월 유지 투자전략
for i in range(1, 13) :
    df, acc_rtn = six_month(sdi, _start=2015, _month=i) 
    print(f'{i}월에 투자 시작 시 수익률 : {round(acc_rtn, 2)}')

1월에 투자 시작 시 수익률 : 2.42
2월에 투자 시작 시 수익률 : 1.95
3월에 투자 시작 시 수익률 : 2.54
4월에 투자 시작 시 수익률 : 1.79
5월에 투자 시작 시 수익률 : 1.81
6월에 투자 시작 시 수익률 : 1.6
7월에 투자 시작 시 수익률 : 1.5
8월에 투자 시작 시 수익률 : 1.5
9월에 투자 시작 시 수익률 : 1.11
10월에 투자 시작 시 수익률 : 1.91
11월에 투자 시작 시 수익률 : 1.8
12월에 투자 시작 시 수익률 : 2.3

/var/folders/lj/ms0l79910fz22cg2hchczhw40000gn/T/ipykernel_9260/2451495709.py:32: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '0.961038961038961' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  result.iloc[i, 2] = rtn
/var/folders/lj/ms0l79910fz22cg2hchczhw40000gn/T/ipykernel_9260/2451495709.py:32: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '0.6651162790697674' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  result.iloc[i, 2] = rtn
/var/folders/lj/ms0l79910fz22cg2hchczhw40000gn/T/ipykernel_9260/2451495709.py:32: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '0.6123188405797102' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  result.iloc[i, 2] = rtn
/var/folders/lj/ms0l79910fz22cg2hchczhw40000gn/T/ipykernel_9260/2451495709.py:32: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '0.8037037037037037' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  result.iloc[i, 2] = rtn
/var/folders/lj/ms0l79910fz22cg2hchczhw40000gn/T/ipykernel_9260/2451495709.py:32: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '0.8875' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  result.iloc[i, 2] = rtn
/var/folders/lj/ms0l79910fz22cg2hchczhw40000gn/T/ipykernel_9260/2451495709.py:32: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '0.975609756097561' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  result.iloc[i, 2] = rtn
/var/folders/lj/ms0l79910fz22cg2hchczhw40000gn/T/ipykernel_9260/2451495709.py:32: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '1.0178571428571428' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  result.iloc[i, 2] = rtn
/var/folders/lj/ms0l79910fz22cg2hchczhw40000gn/T/ipykernel_9260/2451495709.py:32: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '1.0922897196261683' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  result.iloc[i, 2] = rtn
/var/folders/lj/ms0l79910fz22cg2hchczhw40000gn/T/ipykernel_9260/2451495709.py:32: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '1.176678445229682' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  result.iloc[i, 2] = rtn
/var/folders/lj/ms0l79910fz22cg2hchczhw40000gn/T/ipykernel_9260/2451495709.py:32: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '0.9166666666666666' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  result.iloc[i, 2] = rtn
/var/folders/lj/ms0l79910fz22cg2hchczhw40000gn/T/ipykernel_9260/2451495709.py:32: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '1.0555555555555556' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  result.iloc[i, 2] = rtn
/var/folders/lj/ms0l79910fz22cg2hchczhw40000gn/T/ipykernel_9260/2451495709.py:32: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '0.9336099585062241' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  result.iloc[i, 2] = rtn